---
title: C++学习笔记
category: C++
date: 2020-01-05
excerpt: 记录C++的基础知识，包括面向过程和面向对象两个部分。
---

# 一、基于过程的程序设计

## 1.1 概念及基础
* `#pragma once`	//防止头文件重复包含
* 自定义的头文件用`" "`，系统的用`< >`

* **在标准输入流与输出流中使用控制符需要添加#include iomanip头文件**

  C++教材p50页

  有设置基数10、16、8；填充字符；设置精度；字段宽度；输出左对齐右对齐；输出正数给+

  ```C++
  cout<<setiosflags(ios::fixed)<<setiosflags(ios::right)<<setprecision(2);
  //输出数据右对齐，取两位小数
  ```

  

* **putchar和getchar 进行字符的输入和输出**

  * c=getchar() 无参数
  * C++兼容C语言的scanf和printf
    * scanf("%d %c %f",&a,&c,&b);
    * printf("a=%d,b=%f,c=%c\n",a,b,c)

* **switch结构** 

```C++
switch(c)  //括号中可以是数值类型的数据（包括char类型）
{
    case 0:###;break;		//当c与case后的表达式相同时，执行此句
    case 1:###;break;		//冒号后可以是好几句代码，break
        ……
    default:###;			//若所有表达式都不满足，则执行default子句的内嵌语句
        					//default不需要break；同时也可以没有default
}
```

* **C++提供了两种类型的字符串表示形式**

  * C风格字符串

    | Index        | 0       | 1       | 2       | 3       | 4       | 5       |
    | ------------ | ------- | ------- | ------- | ------- | ------- | ------- |
    | **Variable** | H       | e       | l       | l       | o       | \0      |
    | **Address**  | 0x23451 | 0x23452 | 0x23453 | 0x23454 | 0x23455 | 0x23456 |

  * C++引入的**string类**类型
    * 定义字符串string str="Hello";
    * 复制字符串str1=str2;
    * 连接字符串str=str1+str2;
    * 计算字符串长度str.size()
  
* **内置函数（内联函数）**

  ```c++
  #include<iostream>
  using namespace std;
  inline int max(int,int,int);	//可以在声明和定义函数时写inline，也可以只在函数声明时加
  int main()                    //inline，而定义时不加。
  {

      int num;
      string name;
      char sex;
  };
  class Student1:public Student
  {
  public:
      Student1(int n,string nam,char s,int a,string ad):Student(n,nam,s)
      {
          age=a;
          addr=ad;
      }
      void show()
      {
          cout<<"num:"<<num<<endl;
          cout<<"address:"<<addr<<endl;
      }
      ~Student1(){}
  private:
      int age;
      string addr;
  };
  ```

  **注意派生类的构造函数**，Student(n,nam,s)不需要写类型，因为**相当于把前面传进来的参数摘给后边**

  ```C++
  Student1(int n,string nam,char s,int a,string ad):Student(n,nam,s)
      {
          age=a;
          addr=ad;
      }
  ```

  **如果在类内声明，类体外定义则不需写Student(n,nam,s)**

  ```C++
  //类内
  Student1(int n,string nam,char s,int a,string ad);
  //类外定义
  Student1::Student1(int n,string nam,char s,int a,string ad):Student(n,nam,s)
      {
          age=a;
          addr=ad;
      }
  ```

  **还可以直接使用常量或全局变量**

  ```C++
  Student1(int n,string nam,char s,int a,string ad):Student(10010,nam,s)
  ```

  **也可以用参数初始化表**

  ```C++
  Student1(int n,string nam,char s,int a,string ad):Student(n,nam,s),age(a),addr(ad){}
  ```

  执行构造函数和析构函数的顺序：

  1. 派生类构造函数先调用基类构造函数
  2. 再执行派生类构造函数本身（即派生类构造函数的函数体），上述例中：先初始化num,name,sex再初始化age,addr
  3. 在派生类对象释放时，先执行派生类析构函数，再执行基类析构函数

* 有子对象的派生类的构造函数

  指的是成员中含有对象的对象

  ```C++
  //基类中
  Student(int n,string nam):num(n),name(nam){}
  //派生类中
  public:
      Student1(int n,string nam,int n1,string nam1,int a,string ad)
      :Student(n,nam),monitor(n1,nam1)//派生类构造函数
      {
          age=a;
          addr=ad;
      }
  ...
  private:
      Student monitor;	//私有成员中含有类对象
      int age;
      string addr;
  ```

  派生类构造函数的任务包括三个部分

  1. 对基类数据成员的初始化
  2. 对子对象数据成员的初始化
  3. 对派生类数据成员初始化

### 3.1.5多层派生时的构造函数

```C++
class Student
{
public:
    Student(int n,string nam):num(n),name(nam){}
    void display()
    {
        cout<<"num:"<<num<<endl;
        cout<<"name:"<<name<<endl;
    }
protected:
    int num;
    string name;
};

class Student1:public Student
{
public:
    Student1(int n,string nam,int a):Student(n,nam)
    {
        age=a;
    }
    void show()
    {
        display();
        cout<<"age:"<<age<<endl;
    }
private:
    int age;
};

class Student2:public Student1
{
public:
    Student2(int n,string nam,int a,int s):Student1(n,nam,a)
    {
        score=s;
    }
    void show_all()
    {
        show();
        cout<<"score:"<<score<<endl;
    }
private:
    int score;
};
```

### 3.1.6派生类构造函数的特殊形式

* 不需要对派生类新增的成员进行任何初始操作时，派生类构造函数的函数体可以为空

  ```C++
  Student2(int n,string nam,int a,int s):Student1(n,nam,a){}
  ```

* 另一种怪麻烦的，请查谭浩强C++第三版P356页
### 3.1.7继承后子类是否保留父类数据
**子类中所有非静态成员变量都会保留到子类中**
```cpp
class Father
{
public:
	int a;
protected:
	int b;
private:
	int c;
};

class Son :public Father
{
public:
	int d;
};

int main()
{
	cout << "Son的大小是" << sizeof(Son) <<"字节"<< endl;
	输出结果是16字节，说明子类完全地保留了父类的数据
}
```
使用VS自带的工具开发者命令提示工具可以查看类的结构
1.找到文件路径，输入如下命令
`D:\Codes\VisualStudioProjects\Project01\继承后的父类数据是否拷贝>cl /d1 reportSingleClassLayoutSon 源.cpp`
```
class Son       size(16):
        +---
 0      | +--- (base class Father)
 0      | | a
 4      | | b
 8      | | c
        | +---
12      | d
        +---
```
### 3.1.8继承中的构造和析构顺序
创建一个子类对象，其中构造函数和析构函数的顺序如下：
1.父类构造函数
2.子类构造函数
3.子类析构函数
4.父类析构函数
**面试题**：创建一个子类对象会不会有父类对象的创建？**答：有！**


### 3.1.9继承中的同名成员处理
加上作用域::即可。
**注意一下情形**：子类中的同名函数会隐藏掉父类中所有同名函数（包括所有重载形式）需要加作用域才能调用

**继承同名静态成员的处理方式**：
1.同名静态数据成员（编译阶段分配内存，类内声明，类外初始化）
2.同名静态成员函数
处理方式仍然是加上父类作用域以访问父类静态成员
有两种方式:
1.Father::num  
2.Son::Father::num
## 3.2多重继承(multiple inheritance)
*实际开发中不建议使用多继承*
### 3.2.1多重继承的声明

```C++
class D:public A,private B,protected C
{类D新增加的成员}
```

### 3.2.2多重继承派生类的构造函数

```C++
Graduate(string nam,int a,char s,string t,float sco,float w):
        Teacher(nam,a,t),Student(nam,s,sco),wage(w){}
```

### 3.2.3多重继承引起的二义性问题

* 第一种情况：两基类有同名成员

  加上限定符即可，如c1.A::display(); 若在派生类C中的成员函数访问基类A的display,则A::display();

*  第二种情况：两个基类和派生类三者都有同名成员，即有3个display函数

  答案时：会产生**覆盖**，基类的同名函数（注意要保持函数类型、参数个数、参数类型相同，否则就是**重载**）被派生类函数覆盖

* 如果类A和类B是从同一个基类N派生的

  应该加上限定符`A::`或`B::`,如`c1.A::a=3;c1.A::display();`//要访问的是类N的派生类A中的基类成员

## 3.3解决菱形继承问题——虚基类
菱形继承：子类继承两份相同的数据，导致资源浪费以及含义的冲突（如年龄）
### 3.3.1虚基类的作用
C++提供**虚基类**virtual base class的方法，使得**在继承简介共同基类时只保留一份成员**
```mermaid
graph LR
A[A] -- 派生 --> B[B]
A --派生--> C[C]
B --派生--> D[D]
C --派生--> D
```
现在将类A声明为虚基类，**虚基类是在声明派生类时，指定继承方式时声明的！**
```cpp
class A
{...};
class B:virtual public A
{...};
class C:virtual public A
{...};
```
### 3.3.2虚基类的初始化
如果在虚基类中定义了带参数的构造函数，而且没有定义默认构造函数，则在其所有派生类（包括直接派生类和间接派生类）中，通过构造函数的初始化表对虚基类进行初始化。
**在最后的派生类中不仅要负责对其直接基类进行初始化，还要负责对虚基类进行初始化，因为只有一份数据**，如果由B和C分别初始化，会造成数据不一致发生矛盾

```cpp
class A
{A(int i){}		//基类构造函数，有一个参数
..}
class B:virtual public A
{B(int n):A(n){}
...};
class C:virtual public A
{C(int n):A(n){}
...};
class D:public B,public C
{D(int n):A(n),B(n),C(n){}	//D类构造函数，在初始化表中对所有基类初始化
...}
```
**C++编译器只执行最后的派生类对虚基类的构造函数的调用，忽略其他的，保证虚基类的数据成员不会被多次初始化**
**多重继承容易产生二义性问题，如果能用单一继承解决得问题不要使用多重继承**
### 3.3.3基类与派生类的转换
1. 派生类对象可以向基类对象赋值，**相反则不可以**
2. 派生类对象可以替代基类对象向基类对象的引用进行赋值或初始化

```cpp
假设已定义Point类，和派生类Circle
Circle c(1,2,3);//输出的是半径为3的圆
Point&p=c;	//p和c共享 基类Point那一段存储空间
此时p是c的部分引用，注意是部分！p共享c的基类那一部分存储空间，故
cout<<p;	//输出的是(1,2)点信息
```
3. 如果函数的参数是基类对象或基类对象的引用，相应的实参可以用子类对象

```cpp
如有一函数fun
void fun(A&r)			//形参是A类对象的引用
{cout<<r.num<<endl;}	//输出该引用中的数据成员num
//在调用fun函数时可以用派生类B的对象b1作实参
fun(b1);
```
4. 指向基类对象的指针变量也可以指向派生类对象，但通过指向基类对象的指针只能访问派生类中的基类成员，而不能访问派生类增加的成员

## 3.4继承与组合

```cpp
using namespace std;
class Teacher
{
public:
    Teacher(int n,string nam,char s):num(n),name(nam),sex(s){}
    void display()
    {
        cout<<"num="<<num<<endl;
        cout<<"name="<<name<<endl;
        cout<<"sex="<<sex<<endl;
    }
private:
    int num;
    string name;
    char sex;
};

class BirthDate
{
public:
    BirthDate(int y,int m,int d):year(y),month(m),day(d){}
    void display()
    {
        cout<<year<<'/'<<month<<'/'<<day<<endl;
    }
private:
    int year;
    int month;
    int day;
};

class Professor:public Teacher
{
public:
    Professor(int n,string nam,char s,int y,int m,int d)
    :Teacher(n,nam,s),birthday(y,m,d){}
    void show()
    {
        Teacher::display();	//对同名函数加上限定符
        birthday.display();
    }
private:
    BirthDate birthday;
};

```
## 3.5多态性与虚函数
### 3.5.1多态性的概念
多态的实质：父类引用指向子类对象
多态性：**向不同的对象发送同一消息，不同的对象在接收时会产生不同的行为**（即方法），分为**静态多态性**和**动态多态性**。
1. 静态多态性的应用即**函数的重载和运算符重载**,**编译阶段确定函数地址**
2. 动态多态性的特点是：在程序运行过程中动态地确定操作所针对的对象，又称**运行时的多态性**，是通过**虚函数**来实现的。**运行阶段确定函数地址**
### 3.5.2静态多态性

```cpp
using namespace std;
class Point		//点类
{
public:
    Point(float x=0,float y=0);
    void setPoint(float,float);
    float getX()const{return x;}    //读x坐标，getX函数为常成员函数
    float getY()const{return y;}    //读y坐标，getY函数为常成员函数
    friend ostream&operator<<(ostream&,const Point&);//友元重载运算符<<
protected:
    float x,y;
};

Point::Point(float a,float b)
{
    x=a;y=b;
}

void Point::setPoint(float a,float b)
{
    x=a;y=b;
}

ostream&operator<<(ostream&output,const Point&p)    //重载运算符<<，使之能输出点的坐标
{
    output<<'['<<p.x<<','<<p.y<<']'<<endl;
    return output;
}

//派生类Circle
class Circle:public Point
{
public:
    Circle(float x=0,float=0,float=0);//带默认参数的构造函数
    void setRadius(float);  //设置半径值
    float getRadius()const; //读取半径值 常成员函数不能修改数据
    float area()const;      //计算圆面积  设置为常成员函数不能修改数据
    friend ostream&operator<<(ostream&,const Circle &); //重载运算符"<<",使之能输出Circle类对象
protected:
    float radius;
};
//定义构造函数，对圆心坐标和半径初始化
Circle::Circle(float a,float b,float r):Point(a,b),radius(r){}
//设置半径
void Circle::setRadius(float r)
{
    radius=r;
}
//读取半径值
float Circle::getRadius()const
{
    return radius;
}
//计算面积
float Circle::area()const
{
    return 3.14159*radius*radius;
}
//重载运算符“<<"，使之能按规定的形式输出圆的信息
ostream&operator<<(ostream&output,const Circle&c)
{
    output<<"Center=["<<c.x<<','<<c.y<<"],r="<<c.radius<<",area="<<c.area()<<endl;
    return output;
}

//Cylinder是Circle的公用派生类（圆柱体）
class Cylinder:public Circle
{
public:
    //带默认参数的构造函数，若对应数据项不输入则取默认值
    Cylinder(float=0,float=0,float=0,float=0);
    //构造函数初始化
    /*Cylinder(float a,float b,float r,float h)
    :Circle(a,b,r),height(h){} 定义了全部都是默认参数的构造函数后不能再重载构造函数，否则会发生矛盾*/
    void setHeight(float h){height=h;}
    float getHeight()const{return height;}
    float volume()const;
    friend ostream&operator<<(ostream&,const Cylinder&);    //运算符重载只能声明为友元函数，申明为成员函数默认参数为本类对象
private:
    float height;
};
Cylinder::Cylinder(float a,float b,float r,float h)
:Circle(a,b,r){height=h;}
ostream&operator<<(ostream&output,const Cylinder&c)
{
    output<<'['<<c.x<<','<<c.y<<"],r="<<c.radius<<",height="<<c.height<<",volume="<<c.volume()<<endl;
}

float Cylinder::volume()const
{
    return area()*height;
}

int main()
{
    Cylinder c;
    cout<<c;
    Circle&cir=c;		//此时cir部分引用Cylinder类对象c，
    cout<<cir;			//输出的是c的Circle基类部分
    Point&po=c;
    cout<<po;
}


```
### 3.5.3利用虚函数实现动态多态性
所谓虚函数就是在基类声明函数是虚拟的，并不是实际存在的函数，然后在派生类中才正式定义此函数。在程序运行期间，用指针指向某一派生类对象，这样就能调用指针指向的派生类对象中的函数，而不会调用其他派生类中的函数。
注意：**虚函数的作用是允许在派生类中重新定义与基类同名的函数，并且可以通过基类指针或引用来访问基类和派生类中的同名函数。**
**虚函数的使用方法是**：
1. 在基类中用virtual声明成员函数为虚函数。在类外定义虚函数时不必再加virtual
2. 在派生类中重新定义此函数，函数名、函数类型、参数个数和类型必须与基类的虚函数相同，根据派生类的需要重新定义函数体。
当一个成员函数被声明为虚函数后，其派生类中的同名函数**都自动成为虚函数**。因此在派生类重新声明该虚函数时可以加virtual，也可以不加。**但是习惯上一般在每一层声明该函数时都加virtual，使程序更清晰**。
3. 定义一个指向基类对象的指针变量，并使它指向同一类族中需要调用该函数的对象。
4. 通过该指针变量调用此虚函数，此时调用的就是指针变量指向的对象的同名函数

```cpp
Student stud1(1001,"Li",99);
    Graduate grad1(2001,"Wang",98,1200);
    Student*pt=&stud1;
    pt->display();
    pt=&grad1;	//指向基类对象类型的指针，直接修改指向
    pt->display();
```
未定义虚函数时，结果是：

```cpp
num:1001
name:Li
score:99

num:2001
name:Wang
score:98	//调用了基类对象的display()函数
```
定义虚函数后，结果是：

```cpp
num:1001
name:Li
score:99

num:2001
name:Wang
score:98
wage=1200	//调用了子类对象的display()函数
```
### 3.5.4在什么情况下应当声明虚函数
 * 使用虚函数需要注意以下两点
    1. 不能将类外的普通函数声明为虚函数
    2. 一个成员函数被声明为虚函数后，在同一类族中的类就不能再定义一个非virtual得但与该虚函数具有相同得参数和函数返回值类型得同名函数
* 根据什么考虑把一个成员函数声明为虚函数
  1. 首先看成员函数所在的类是否会作为基类。然后看成员函数再类的继承后有无可能被更改功能，如果希望其更改功能的，一般应声明为虚函数
  2. 如果成员函数在类被继承后功能无需修改，或在派生类中用不到该函数，则不要把他声明为虚函数。
  3. 应考虑对成员函数的调用是通过对象名还是通过基类指针或引用去访问，如果是通过基类指针或引用去访问，则应当声明为虚函数。‘
  4. 有时，在定义虚函数时，并不定义其函数体，即函数体是空的。它的作用只是定义了一个虚函数名，具体功能留给派生类去添加。
* 需要说明的是：使用虚函数，系统有一定的时空开销。当一个类带有虚函数时，编译系统会为该类构造一个虚函数表(virtual function table，简称vtable)，它是一个指针数组，存放每个虚函数的入口地址，系统在进行动态关联时的时间开销是很小的，因此，**多态性是高效的**。 
### 3.5.5虚析构函数
析构函数的作用是在对象撤销之前做必要的“清理现场”的工作。当派生类的对象从内存中撤销时，一般先调用派生类的析构函数，然后调用基类的析构函数。但是如果用new运算符建立了临时对象，若基类中有析构函数，并且定义了一个指向该基类的指针变量。在程序中用delete运算符撤销对象时，会发生一个情况：系统只会执行基类的析构函数，而不执行派生类的析构函数。

```cpp
#include<iostream>
using namespace std;
class Point
{
public:
    Point(){}
    ~Point(){cout<<"Executing Point destructor"<<endl;}
};

class Circle:public Point
{
public:
    Circle(){}
    ~Circle(){cout<<"executing Circle destuctor"<<endl;}
private:
    int radius;
};

int main()
{
    Point*p=new Circle;
    delete p;
}
```
此时，执行结果是：Executing Point destructor
只调用了基类的析构函数。如果希望能执行派生类circle的析构函数，可以将基类中的析构函数声明为虚函数

```cpp
virtual~Point(){cout<<"Executing Point destructor"<<endl;}
```
此时执行结果便是
executing Circle destructor
Executing Point destructor
* 虚构函数的概念和用法很简单，但它在面向对象程序设计中是很重要的技巧。专业人员一般都习惯声明虚析构函数，即使基类并不需要析构函数，也显式地定义一个函数体为空的虚析构函数，以保证在撤销动态分配空间时能得到正确的处理。
* 构造函数不能声明为虚函数。因为在执行构造函数时类对象还未完成建立过程，当然谈不上把函数与类对象的绑定。
### 3.5.6多态的原理剖析
多态的原理：用**虚函数表**来实现的
声明了虚函数的类中，会添加一个vfptr虚函数表指针，指向自己的虚函数表vftable
我们使用vs开发人员命令提示符查看该类的结构,结果如下：
类的代码
```cpp
class Animal
{
public:
	virtual void sound() {
		cout << "动物叫~" << endl;
	}
};
```
查看结果
```
class Animal    size(4):
        +---
 0      | {vfptr}
        +---

Animal::$vftable@:
        | &Animal_meta
        |  0
 0      | &Animal::sound		//记录下虚函数入口地址

Animal::sound this adjustor: 0
```
如果子类没有重写父类方法，子类结构：
```
class Cat       size(4):
        +---
 0      | +--- (base class Animal)
 0      | | {vfptr}
        | +---
        +---

Cat::$vftable@:
        | &Cat_meta
        |  0
 0      | &Animal::sound		//存放的是父类sound函数的入口地址
```
重写父类方法后，子类结构：
```
class Cat       size(4):
        +---
 0      | +--- (base class Animal)
 0      | | {vfptr}
        | +---
        +---

Cat::$vftable@:
        | &Cat_meta
        |  0
 0      | &Cat::sound
```
## 3.6纯虚函数与抽象类
### 3.6.1纯虚函数 
* 声明纯虚函数pure virtual function

```cpp
virtual float area(参数列表)const=0;//只需在虚函数声明后再加=0，const不是必要
```
* 纯虚函数只有函数的名字而不具备函数的功能，不能被调用。它只是通知编译系统：我在这里声明了一个虚函数，留待派生类中定义。
### 3.6.2抽象类
不用来定义对象，而只作为一种基本类型用作继承的类，成为**抽象类**abstract class)，由于它常用作基类，通常称为**抽象基类**abstract base class。**凡是包含纯虚函数的类都是抽象类**。因为纯虚函数是不能被调用的，包含纯虚函数的类无法建立对象，抽象类的作用是作为一个类族的共同基类，或者说为一个类族提供一个公共接口。
**继承抽象类的子类如果不对所有的纯虚函数进行重写，那么它也是一个抽象类，不能实例化**。
好多的面向对象的系统，其层次结构的顶部是一个抽象基类，甚至顶部有好几层都是抽象类。
如果在抽象类所派生出的新类中对基类的**所有纯虚函数**进行了定义，那么这些函数就被赋予了功能，可以被调用。这个派生类就成为了**具体类**concrete class。
虽然抽象类不能定义对象（或者说抽象类不能实例化），但是可以定义指向抽象类数据的指针类型。当派生类成为具体类后，就可以用这种指针指向派生类对象，然后通过调用虚函数，实现多态性的操作。
```cpp
#include<iostream>
using namespace std;
class AbstractMakeDrink
{
public:
	virtual void spoilWater() = 0;
	virtual void putIn() = 0;
	virtual void addThings() = 0;
